export const buttons = {
  Signup: 'Зарегистрироваться',
  Reg: 'Регистрация',
  Signin: 'Войти',
  Account: 'Аккаунт',
  Search: 'Поиск',
  Short: 'Короткометражки',
  More: 'Ещё',
};

export const headerText = {
  text: 'Учебный проект студента факультета Веб-разработки.',
};

export const aboutText = {
  Title: 'О проекте',
  Steps: 'Дипломный проект включал 5 этапов',
  StepsDescription: 'Составление плана, работу над бэкендом, вёрстку, добавление функциональности и финальные доработки.',
  Time: 'На выполнение диплома ушло 5 недель',
  TimeDescription: 'У каждого этапа был мягкий и жёсткий дедлайн, которые нужно было соблюдать, чтобы успешно защититься.',
  Week1: '1 неделя',
  Week4: '4 недели',
  Front: 'Front-end',
  Back: 'Back-end',
};

// Переделать в массив, чтобы потом рендерить
export const technology = {
  HTML: 'HTML',
  CSS: 'CSS',
  JS: 'JS/TS',
  React: 'React',
  Git: 'Git',
  Express: 'Express.js',
  Mongo: 'MongoDB',
};

export const techText = {
  Title: 'Технологии',
  Amount: `7 технологий`,
  Subtitle: 'На курсе веб-разработки мы освоили технологии, которые применили в дипломном проекте.'
};

export const aboutMe = {
  Title: 'Студент',
  Name: `Дмитрий Гордон`,
  Subtitle: 'Фронтенд-разнорабочий, 54 года',
  Description:
    'К пяти годам я уже не только умел читать, но и наизусть знал все семантические тэги HTML, а любимыми моими игрушками были дебаггеры и консоль-логи. В Практикум пошел в шесть лет и благополучно закончил его через 1.5 месяца, поскольку на первых 15 спринтах не учился — сразу перешел на диплом, сдав работы скачанные с открытых репозиториев на GitHub экстерном. Гений? Ну, типа.',
  Site: 'Сайт Д. Гордона',
  Git: 'GitHub'
};

export const portfolio = {
  Title: 'Портфолио',
  Static: 'Статичный сайт',
  Adaptive: 'Адаптивный сайт',
  SPA: 'Одностраничное приложение'
}

export const footer = {
  Title: 'Учебный проект Яндекс.Практикум х BeatFilm.',
  Copyright: '© 2021',
  Yandex: 'Яндекс.Практикум',
  Git: 'GitHub',
  Telegram: 'Telegram'
}